class Memory {
    // Метод для сохранения выбранной темы
    saveTheme(theme: string): void {
        // Сохранение выбранной темы
    }

    // Метод для сохранения настроек звука
    saveSoundPreference(isOn: boolean): void {
        // Сохранение настроек звука
    }

    // Метод для сохранения состояния пользователя (например, авторизован/не авторизован)
    saveUser(isIn: boolean): void {
        // Сохранение состояния пользователя
    }
}

// Создание экземпляра класса Memory
const memory = new Memory();
